tests/com/l7tech/service/resources/sampleSignedSamlHolderOfKeyRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soapenv:mustUnderstand="true"><wsu:Timestamp wsu:Id="Timestamp-1-cbf9c32b5863bd51b8327801b23f9a50"><wsu:Created>2004-08-17T19:09:23.828Z</wsu:Created><wsu:Expires>2004-08-17T19:14:23.828Z</wsu:Expires></wsu:Timestamp><saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" AssertionID="SamlAssertion-0d7f8b2db84caf3280963e29583d27b4" IssueInstant="2004-08-17T19:09:22.953Z" Issuer="riker" MajorVersion="1" MinorVersion="1"><saml:Conditions NotBefore="2004-08-17T19:09:00.000Z" NotOnOrAfter="2004-08-17T19:14:00.000Z"></saml:Conditions><saml:AuthenticationStatement AuthenticationInstant="2004-08-17T19:09:23.640Z" AuthenticationMethod="urn:ietf:rfc:3075"><saml:Subject><saml:NameIdentifier Format="urn:oasis:names:tc:SAML:1.1:nameid-format:X509SubjectName">CN=John Smith, OU=Java Technology Center, O=IBM, L=Cupertino, ST=California, C=US</saml:NameIdentifier><saml:SubjectConfirmation><saml:ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:holder-of-key</saml:ConfirmationMethod><xd:KeyInfo xmlns:xd="http://www.w3.org/2000/09/xmldsig#"><xd:X509Data><xd:X509SubjectName>CN=John Smith, OU=Java Technology Center, O=IBM, L=Cupertino, ST=California, C=US</xd:X509SubjectName><xd:X509Certificate>MIICZjCCAc8CBD2+61QwDQYJKoZIhvcNAQEEBQAwejELMAkGA1UEBhMCVVMxEzARBgNVBAgTCkNhbGlmb3JuaWExEjAQBgNVBAcTCUN1cGVydGlubzEMMAoGA1UEChMDSUJNMR8wHQYDVQQLExZKYXZhIFRlY2hub2xvZ3kgQ2VudGVyMRMwEQYDVQQDEwpKb2huIFNtaXRoMB4XDTAyMTAyOTIwMTEwMFoXDTA3MTAwMzIwMTEwMFowejELMAkGA1UEBhMCVVMxEzARBgNVBAgTCkNhbGlmb3JuaWExEjAQBgNVBAcTCUN1cGVydGlubzEMMAoGA1UEChMDSUJNMR8wHQYDVQQLExZKYXZhIFRlY2hub2xvZ3kgQ2VudGVyMRMwEQYDVQQDEwpKb2huIFNtaXRoMIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQCtitis5FONvv236Xw1CKOvKAOQ0NYlvRd/FKwuf+T1XCFadHMrtvHhq/+Z/Dlcn2YQYOCp9auS+WkBcL0AUrJJPUbwZIB2CyBZJjnS7+jdb37RKYQUsNRNlgdIcoZM8bvCZldBSfnat4xDPyQOJB7ExDrMmI9tP0NY9GN0npfnwwIDAQABMA0GCSqGSIb3DQEBBAUAA4GBAFLNrEP8Y0xwUVIl4XigEiDM6jAdDJFCI+m8EA07nAsYWmV/Ic8kkqDzXaWyLkIBJQ0gElRlWHYe+W/K/pT9CNEWRFViKbZGevivBKek7GQXhuEgo+pWalpEtg4nA741+46iKeKpEQILL6OYEj7aHcreIxaQ1WH2v1iMig33Q0+S</xd:X509Certificate></xd:X509Data></xd:KeyInfo></saml:SubjectConfirmation></saml:Subject><saml:SubjectLocality DNSAddress="Data.l7tech.com" IPAddress="192.168.1.221"></saml:SubjectLocality></saml:AuthenticationStatement><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
  <ds:SignedInfo>
    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod>
    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod>
    <ds:Reference URI="#SamlAssertion-0d7f8b2db84caf3280963e29583d27b4">
      <ds:Transforms>
        <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"></ds:Transform>
        <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform>
      </ds:Transforms>
      <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
      <ds:DigestValue>HvKtOKInULa5oJxnqktdTJM0EGo=</ds:DigestValue>
    </ds:Reference>
  </ds:SignedInfo>
  <ds:SignatureValue>
    dA/ojLahPpLpq/dM/vxGi6bH1lanE9oRJQdjB7y8pnMK+PCi7Twic6GxT9J4sfaLv3KNBH8g
    fxgJT8j01Jfr+RggKYEIev5nMjVpvy0Dpn/m8A6CuWgT7JqfE9ZvjD8kJPfeXEgyceDNYkta
    Sni+/YQhKEibvFKlEvkJsVat1fI=
  </ds:SignatureValue>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
    <X509Data>
      <X509SubjectName>CN=riker</X509SubjectName>
      <X509Certificate>
MIICBjCCAW+gAwIBAgIIKbOOqzbBdVAwDQYJKoZIhvcNAQEFBQAwFTETMBEGA1UEAxMKcm9vdC5y
aWtlcjAeFw0wNDAzMjQyMzAyMTFaFw0wNjAzMjQyMzEyMTFaMBAxDjAMBgNVBAMTBXJpa2VyMIGf
MA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQC6OKq/fMQAnsN5JQnZ9QqTBimVpnGQA5WAeuxqkTL3
iLLvWMAhdyUJsCvAzc1S1zZ4yVPZkkE9emTLeIMXtt8ae9UejWAwPsVgRIR4zAiciYCkiSO8odch
OYxgp2uRZbzk5OpEegTO0Gbfdkitdk285I9yNarJLC9FywOH3Kq6fQIDAQABo2QwYjAPBgNVHRMB
Af8EBTADAQEAMA8GA1UdDwEB/wQFAwMHoAAwHQYDVR0OBBYEFHVi/P0XVUNE93zBx0wD/80kkT7w
MB8GA1UdIwQYMBaAFB+jwNtU61J/yk++WodvTbQrBux2MA0GCSqGSIb3DQEBBQUAA4GBAB5/WyqI
b7QLot5Xbh+MIlrTwoXtjHwnqRPrb8YkxARdhh4hB+632yMLDv90ReZg41kXZ1Lxd/lh8PaNFlSF
erCg/6stx3xIbU4eT3WW9ws8ohL7NaaHgW3Yqo4e6aqxJ5T9NEfW6CQEdE32AZfDz6HLzWdcj0Gn
qp3yxOSenf2T
      </X509Certificate>
    </X509Data>
  </KeyInfo></ds:Signature></saml:Assertion><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
  <ds:SignedInfo>
    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><c14n:InclusiveNamespaces xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""></c14n:InclusiveNamespaces></ds:CanonicalizationMethod>
    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod>
    <ds:Reference URI="#Body-0-2905c5342a6d63bedb9d7d352a5b567a">
      <ds:Transforms>
        <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><c14n:InclusiveNamespaces xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""></c14n:InclusiveNamespaces></ds:Transform>
      </ds:Transforms>
      <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
      <ds:DigestValue>PZyGqRjt+XJMDdq4v+68lFRBvLw=</ds:DigestValue>
    </ds:Reference>
    <ds:Reference URI="#Timestamp-1-cbf9c32b5863bd51b8327801b23f9a50">
      <ds:Transforms>
        <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><c14n:InclusiveNamespaces xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList=""></c14n:InclusiveNamespaces></ds:Transform>
      </ds:Transforms>
      <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
      <ds:DigestValue>qGL74swoMJ/+lCKqEqiOwJp+HLA=</ds:DigestValue>
    </ds:Reference>
  </ds:SignedInfo>
  <ds:SignatureValue>
    VSRRQUTYcMXdQb4iddKWj5+2W/7RZ3rorV6Xnsmw2zcBUG9BugAIeTJY5QbEIi4kOLYvW3M1
    tdwyixMqN5S4GlGvmg2rerxOSuNGJc9IBRvJM25U79JE3S9NjBosAVbJHohEfhAvk44/KuSX
    uoxYBK+qUKkhQUXhZAXsQVaLuzc=
  </ds:SignatureValue>
<ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#SamlAssertion-0d7f8b2db84caf3280963e29583d27b4" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"></wsse:Reference></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header><soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Body-0-2905c5342a6d63bedb9d7d352a5b567a">
        <ns1:placeOrder xmlns:ns1="http://warehouse.acme.com/ws" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
            <productid xsi:type="xsd:long">-9206260647417300294</productid>
            <amount xsi:type="xsd:long">1</amount>
            <price xsi:type="xsd:float">5.0</price>
            <accountid xsi:type="xsd:long">228</accountid>
        </ns1:placeOrder>
    </soapenv:Body>
</soapenv:Envelope>
