modules/common/src/test/resources/com/l7tech/common/resources/ecc/ecdsa_sha256_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" actor="secure_span" soapenv:mustUnderstand="1"><wsu:Timestamp wsu:Id="Timestamp-2-553606b5f999302057873998702d3333"><wsu:Created>2009-03-02T23:47:32.503464391Z</wsu:Created><wsu:Expires>2009-03-02T23:52:32.503Z</wsu:Expires></wsu:Timestamp><wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="BinarySecurityToken-0-4a660b5b6d21aa4ef5704bf6730122e2">MIIBezCCATGgAwIBAgIJANKvvVMn645NMAoGCCqGSM49BAMCMBgxFjAUBgNVBAMMDWVjY3Rlc3RjbGllbnQwHhcNMDkwMzAyMjMzNzMxWhcNMjkwMjI1MjMzNzMxWjAYMRYwFAYDVQQDDA1lY2N0ZXN0Y2xpZW50MEkwEwYHKoZIzj0CAQYIKoZIzj0DAQEDMgAE3n2qu8oxqu1mzVvh5/ZvrMik+a0pJqrXV2ikIX8QvN2e2niWG7OnSKMbhrKPlNrUo3QwcjAMBgNVHRMBAf8EAjAAMA4GA1UdDwEB/wQEAwIF4DASBgNVHSUBAf8ECDAGBgRVHSUAMB0GA1UdDgQWBBQQi1qUZbm2d+IMji8l9xVQ20jmnDAfBgNVHSMEGDAWgBQQi1qUZbm2d+IMji8l9xVQ20jmnDAKBggqhkjOPQQDAgM4ADA1AhkA3iM/ZvTXgWjAr/CdHjsFJYfwWLblaMqFAhhQub5voa+DHjehHkRWbRFhuMqM+dPUntw=</wsse:BinarySecurityToken><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#ecdsa-sha256"></ds:SignatureMethod><ds:Reference URI="#Body-1-7cbcc17c687efc9bc522909f1812dda3"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"></ds:DigestMethod><ds:DigestValue>KANDXN3kAvEy/r9OWws5JalAtcm/d/9YypG33IEG45I=</ds:DigestValue></ds:Reference><ds:Reference URI="#Timestamp-2-553606b5f999302057873998702d3333"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"></ds:DigestMethod><ds:DigestValue>xO7vF5o15S4ZC0UQ+opfJ2lC8TAbhdtPj1UL6gcznKk=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>MDYCGQCw0ZfOtMJPi7uVECFdffeuq8w281xIgm8CGQCfYAP5sN8gtkKOl+x5A/RWvd1DAWzmcmo=</ds:SignatureValue><ds:KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#BinarySecurityToken-0-4a660b5b6d21aa4ef5704bf6730122e2" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"></wsse:Reference></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header><soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Body-1-7cbcc17c687efc9bc522909f1812dda3">
        <ns1:placeOrder xmlns:ns1="http://warehouse.acme.com/ws" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
            <productid xsi:type="xsd:long">-9206260647417300294</productid>
            <amount xsi:type="xsd:long">1</amount>
            <price xsi:type="xsd:float">5.0</price>
            <accountid xsi:type="xsd:long">228</accountid>
        </ns1:placeOrder>
    </soapenv:Body>
</soapenv:Envelope>
